app/controllers/posts_controller.rb

INSERT INTO `posts` (`body`, `image`, `created_at`, `updated_at`, `user_id`, `user_name`, `user_image`) VALUES ('IdentWebスマホ対応させた。\r\nいやー　なんかデザイン僕成長したかも。\r\n遊びサーチはひどかったｗ', 'コメント_2020-03-04_100524.png', '2020-03-11 22:58:50', '2020-03-11 22:58:50', 1, '開発　光', '/uploads/user/image/1/computer_programming_man.png')
---
  def create
  	@post = Post.new(create_params)
    @post.user_id = current_user.id
  	if @post.save

DELETE FROM `posts` WHERE `posts`.`id` = 5
---
  def destroy
    @post.destroy

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def post_find
  	@post = Post.find params[:id]